Revit 2027 API
BendingDetailCustomFieldProperties.SegmentsRepresentation Property
 Identifies how the bending detail will represent the segments of the bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BendingDetailSegmentsRepresentation SegmentsRepresentation { get; set; }
Public Property SegmentsRepresentation As BendingDetailSegmentsRepresentation
	Get
	Set
public:
property BendingDetailSegmentsRepresentation SegmentsRepresentation {
	BendingDetailSegmentsRepresentation get ();
	void set (BendingDetailSegmentsRepresentation value);
}
member SegmentsRepresentation : BendingDetailSegmentsRepresentation with get, set
Property Value
BendingDetailSegmentsRepresentation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace